InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире/Forms/ФормаЗаписиУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ТекстСообщения = "Элемент не может быть записан!";
	
	Если НЕ ЗначениеЗаполнено(Запись.ТипКвартиры) Тогда
		
		ТекстСообщения = ТекстСообщения + "Не заполнен тип квартиры.";
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.СтатусКвартиры) Тогда
		
		ТекстСообщения = ТекстСообщения + " Не заполнен статус квартиры.";
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Запись.ОбщаяПлощадь < Запись.ЖилаяПлощадь Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Общая площадь меньше жилой.");
		
		Отказ = Истина;
		
	КонецЕсли;	
	
	Если Отказ Тогда
		
		бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// БИТ_ЖКХ 09.09.2016 11:21:19 Начало правки...
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 11:21:19 Конец правки.
	
	Оповестить("ИзменениеДляКвартиры", , Запись.Квартира);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
		Оповестить("ИзменениеДляКвартиры",,Запись.Квартира);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++АнисимоваМВ 21.11.2024 заполнение по существующим данным при создании  
	Если НЕ РеквизитФормыВЗначение("Запись").Выбран() Тогда
		ЗаполнитьЗанныеДляНового();
			
	КонецЕсли;	    
	Если Запись.Период<НачалоМесяца(ТекущаяДатаСеанса()) И РольДоступна("лб_АбонОтделСотрудникФилиала") Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	//--АнисимоваМВ 21.11.2024 заполнение по существующим данным при создании

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗанныеДляНового()
	//++АнисимоваМВ 21.11.2024 заполнение по существующим данным при создании  
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира,
		|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
		|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь КАК ЖилаяПлощадь,
		|	бит_СведенияОКвартиреСрезПоследних.МОП КАК МОП,
		|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь КАК ОтапливаемаяПлощадь,
		|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь КАК СовокупнаяПлощадь,
		|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
		|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
		|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты КАК ТипПлиты,
		|	бит_СведенияОКвартиреСрезПоследних.ТипЗапирающегоУстройства КАК ТипЗапирающегоУстройства,
		|	бит_СведенияОКвартиреСрезПоследних.ЖилоеПомещениеСпециализированногоЖилищногоФонда КАК ЖилоеПомещениеСпециализированногоЖилищногоФонда,
		|	бит_СведенияОКвартиреСрезПоследних.ПлощадьОДНСОИЭлектроснаб КАК ПлощадьОДНСОИЭлектроснаб,
		|	бит_СведенияОКвартиреСрезПоследних.ПлощадьОДНСОИВодоснаб КАК ПлощадьОДНСОИВодоснаб,
		|	бит_СведенияОКвартиреСрезПоследних.ВысотаПотолков КАК ВысотаПотолков,
		|	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК лб_ПредставлениеКвартиры,
		|	бит_СведенияОКвартиреСрезПоследних.лб_ИгнорироватьСальдоСвоихУслуг КАК лб_ИгнорироватьСальдоСвоихУслуг,
		|	бит_СведенияОКвартиреСрезПоследних.лб_НеВыводитьСтрокуДомофон КАК лб_НеВыводитьСтрокуДомофон,
		|	бит_СведенияОКвартиреСрезПоследних.лб_ПлощадьКапремонта КАК лб_ПлощадьКапремонта
		|ИЗ
		|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних КАК бит_СведенияОКвартиреСрезПоследних
		|ГДЕ
		|	бит_СведенияОКвартиреСрезПоследних.Квартира = &Квартира";
	
	Запрос.УстановитьПараметр("Квартира", Запись.Квартира);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		 ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
	 КонецЕсли;             
	 Запись.Период = НачалоМесяца(ТекущаяДатаСеанса());
	//--АнисимоваМВ 21.11.2024 заполнение по существующим данным при создании

КонецПроцедуры

#КонецОбласти
